# GetStartingViewSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StartingViewSettings..::..GetStartingViewSettings Method
StartingViewSettings Class See Also
---
Returns the starting view settings for the specified document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static StartingViewSettings GetStartingViewSettings(
	Document doc
)
```

Visual Basic
---
```text
Public Shared Function GetStartingViewSettings ( _
	doc As Document _
) As StartingViewSettings
```

Visual C++
---
```text
public:
static StartingViewSettings^ GetStartingViewSettings(
	Document^ doc
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document The document to get the settings from, which must be a project document.
# ### Return Value
The starting view settings for the document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | doc is not a project document. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StartingViewSettings Class
Autodesk.Revit.DB Namespace